/*Програма, със целочисена променлива, чиято стойност се въвежда от потребителя и
връжа като резултат лицето на окръжност и нейната обиколка. Радиуса е целочисленета променлива*/
//Има някакъв бъг и конзолата показва случайни принципи.
#include <iostream>
using namespace std;

int main()
{
    int r;
    double S, P, pi = 3.14;

    cout << "Въведете радиуса на окръжността: ";
    cin >> r;

    S = r * r * pi;
    P = 2 * pi * r;

    cout << "Лицето на окръжността е равно на: " << S;
    cout << "\nОбиколката на окръжността е равна на: " << P;

    return 0;
}